# Python : pandas. Pratique et exercices

**NOTES**.

 - Il existe de nombreuses façons de résoudre chaque problème, trouvez la vôtre.

 - Créez les cellules supplémentaires dont vous avez besoin.

 - N'oubliez pas qu'une cellule peut être une cellule Code ou une cellule Markdown. Utilisez cette dernière pour écrire du texte et des explications si nécessaire.

 - Essayez de créer des variables lorsque vous résolvez les exercices.

 - Vous pouvez compter sur Internet : tous les programmeurs le font tous les jours.

<img width=500 src="https://upload.wikimedia.org/wikipedia/commons/3/31/TitanicBeken.jpg">

Nous importons le fichier csv du Titanic dans un dataframe

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../datasets/titanic.csv")

Regardez les premières lignes de la base de données

In [4]:
df.head(3)

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0

In [5]:
df.tail(2)

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1307,"Gustafsson, Mr. Anders Vilhelm",male,37.0,3,2,0,3101276,7.9250,NaN,S,0
1308,"McDermott, Miss. Brigdet Delia",female,NaN,3,0,0,330932,7.7875,NaN,Q,1

Combien de passagers y a-t-il dans ce dataframe?

In [6]:
df.shape

(1309, 11)

In [7]:
df.shape[0]

1309

Quelles sont les colonnes du dataframe?

In [14]:
df.columns

Index(['Name', 'Sex', 'Age', 'Pclass', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [15]:
for col in df.columns:
    if len(col) > 5:
        print(col)

Pclass
Ticket
Embarked
Survived

Liste les colonnes de type numérique

In [17]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [16]:
df.dtypes

Name         object
Sex          object
Age         float64
Pclass        int64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
Survived      int64
dtype: object

Quel est l'âge moyen des passagers ? Et la médiane ? Comment interpréter les résultats ?

In [21]:
df.Age.mean().round(1)

29.9

In [22]:
df.Age.median().round(1)

28.0

<img width=400 src="https://miro.medium.com/v2/resize:fit:846/1*XU3Kdl521XnWHECHZ7XOaQ.jpeg">

Combien a coûté le billet le plus cher ? Qui l'a payé ?

In [24]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [25]:
df.Fare.max()

512.3292

In [35]:
df[df.Fare == df.Fare.max()]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
255,"Cardeza, Mrs. James Warburton Martinez",female,58.0,1,0,1,PC 17755,512.3292,B51 B53 B55,C,1
272,"Lesurer, Mr. Gustave J",male,35.0,1,0,0,PC 17755,512.3292,B101,C,1
543,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,1,0,1,PC 17755,512.3292,B51 B53 B55,C,1
1152,"Ward, Miss. Anna",female,35.0,1,0,0,PC 17755,512.3292,NaN,C,1

Combien ont-ils payé entre tous les passagers ?

Il serait nécessaire de vérifier s'il y a des données manquantes

In [42]:
df.Fare.isna().sum()

1

In [36]:
df.Fare.sum()

43550.4869

Qui était le plus jeune passager et quel âge avait-il ?

In [43]:
df.Age.min()

0.17

In [46]:
df[df.Age == df.Age.min()]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
151,"Dean, Miss. Elizabeth Gladys Millvina",female,0.17,3,1,2,C.A. 2315,20.575,NaN,S,1

In [47]:
df[df.Age < 1]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
104,"Hamalainen, Master. Viljo",male,0.67,2,1,1,250649,14.5000,NaN,S,1
151,"Dean, Miss. Elizabeth Gladys Millvina",female,0.17,3,1,2,C.A. 2315,20.5750,NaN,S,1
211,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,3,0,2,347080,14.4000,NaN,S,0
580,"Peacock, Master. Alfred Edward",male,0.75,3,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S,0
650,"Caldwell, Master. Alden Gates",male,0.83,2,0,2,248738,29.0000,NaN,S,1
675,"Thomas, Master. Assad Alexander",male,0.42,3,0,1,2625,8.5167,NaN,C,1
807,"Baclini, Miss. Helene Barbara",female,0.75,3,2,1,2666,19.2583,NaN,C,1
855,"West, Miss. Barbara J",female,0.92,2,1,2,C.A. 34651,27.7500,NaN,S,1
1015,"Allison, Master. Hudson Trevor",male,0.92,1,1,2,113781,151.5500,C22 C26,S,1
1133,"Baclini, Miss. Eugenie",female,0.75,3,2,1,2666,19.2583,NaN,C,1
1291,"Richards, Master. George Sibley",male,0.83,2,1,1,29106,18.7500,NaN,S,1
1303,"Aks, Master. Philip Frank",male,0.83,3,0,1,392091,9.3500,NaN,S,1

Combien de passagers avaient moins de 20 ans ? Quel est le pourcentage ?

In [49]:
df[df.Age < 20].shape

(225, 11)

In [51]:
(df.Age < 20).sum()

225

In [52]:
(df.Age < 20).sum() / df.shape[0] * 100

17.188693659281896

Quel est le 9e décile d'âge ?

In [53]:
df.Age.quantile(0.90)

50.0

Combien de personnes ont survécu ? Combien de personnes sont mortes ?

In [54]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [56]:
df.Survived.value_counts()

0    809
1    500
Name: Survived, dtype: int64

Combien de personnes y avait-il dans chaque classe ?

In [59]:
df.Pclass.value_counts().sort_index()

1    323
2    277
3    709
Name: Pclass, dtype: int64

Avait-il plus de chances de survivre en première classe ?

In [62]:
pd.crosstab(df.Pclass, df.Survived, normalize="index").round(2)

Survived     0     1
Pclass
1         0.38  0.62
2         0.57  0.43
3         0.74  0.26

In [63]:
pd.crosstab(df.Pclass, df.Survived, normalize="columns").round(2)

Survived     0     1
Pclass
1         0.15  0.40
2         0.20  0.24
3         0.65  0.36

In [65]:
pd.crosstab(df.Pclass, df.Survived)

Survived    0    1
Pclass
1         123  200
2         158  119
3         528  181

In [71]:
pd.crosstab(df.Pclass, df.Survived, normalize="all")

Survived         0         1
Pclass
1         0.093965  0.152788
2         0.120703  0.090909
3         0.403361  0.138273

In [70]:
pd.crosstab(df.Pclass, df.Survived, normalize="all").round(2)

Survived     0     1
Pclass
1         0.09  0.15
2         0.12  0.09
3         0.40  0.14

Avec combien de membres de la famille les personnes ont-elles voyagé (dans la colonne SibSp) ?

In [72]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

In [75]:
df.SibSp.value_counts().sort_index()

0    891
1    319
2     42
3     20
4     22
5      6
8      9
Name: SibSp, dtype: int64

In [76]:
df[df.SibSp == 8]

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
77,"Sage, Master. William Henry",male,14.5,3,8,2,CA. 2343,69.55,NaN,S,0
105,"Sage, Mr. Frederick",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
232,"Sage, Miss. Stella Anna",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
271,"Sage, Mr. Douglas Bullen",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
317,"Sage, Master. Thomas Henry",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
523,"Sage, Miss. Ada",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
871,"Sage, Mr. George John Jr",male,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
1211,"Sage, Miss. Constance Gladys",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0
1277,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,3,8,2,CA. 2343,69.55,NaN,S,0

Combien de portes d'embarquement y avait-il ?

In [80]:
df.Embarked.nunique()

3

In [79]:
df.Embarked.unique()

array(['S', 'Q', 'C', nan], dtype=object)

In [78]:
df.Embarked.value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

Créez un dataframe avec les personnes qui ont voyagé en première classe.

In [89]:
df_premiere_classe = df[df.Pclass == 1]

In [90]:
df_premiere_classe.shape

(323, 11)

In [92]:
df_premiere_classe.Survived.value_counts()

1    200
0    123
Name: Survived, dtype: int64

Créer un dataframe contenant les femmes et les enfants

In [96]:
df_petite_bateaux = df[(df.Sex == "female") | (df.Age < 18)]

In [97]:
df_petite_bateaux.shape

(548, 11)

In [98]:
df_petite_bateaux.Survived.value_counts()

1    370
0    178
Name: Survived, dtype: int64

Créez un dataframe avec les personnes qui ne voyageront pas sur le `S`.

In [105]:
df_no_S = df[~(df.Embarked == "S")]

In [106]:
df_no_S.shape

(395, 11)

In [107]:
df_no_S.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
5,"Douglas, Mrs. Frederick Charles",female,27.0,1,1,1,PC 17558,247.5208,B58 B60,C,1
6,"Moran, Miss. Bertha",female,NaN,3,1,0,371110,24.1500,NaN,Q,1
8,"Bradley, Miss. Bridget Delia",female,22.0,3,0,0,334914,7.7250,NaN,Q,1
12,"Laroche, Mrs. Joseph",female,22.0,2,1,2,SC/Paris 2123,41.5792,NaN,C,1

Créez une colonne booléenne qui indique si le passager est majeur.

In [109]:
df["is_big"] = df.Age >= 18

In [110]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,is_big
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0,True
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1,True
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0,True
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1,True
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1,True

Créez une colonne avec le titre de chaque passager

In [116]:
email = "manolete89@hotmail.com"

In [120]:
email.split("@")[1].split(".")[0]

'hotmail'

In [125]:
df["title"] = df.Name.str.split(", ").str[1].str.split(". ").str[0]

In [126]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,is_big,title
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0,True,Mr
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1,True,Mrs
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0,True,Mrs
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1,True,Mrs
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1,True,Miss

In [127]:
df.title.value_counts()

Mr          757
Miss        259
Mrs         179
Master       61
Mrs.         18
Dr            8
Rev           8
Col           4
Major         2
Mlle          2
Ms            2
Lady.         1
Miss.         1
Don           1
Sir           1
Mme           1
Capt          1
Jonkheer      1
Dona          1
th            1
Name: title, dtype: int64

In [129]:
df[df.title == "Mrs."].head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,is_big,title
19,"Mellinger, Mrs.",female,41.0,2,0,1,250644,19.5000,NaN,S,1,True,Mrs.
60,"Chibnall, Mrs.",female,NaN,1,0,1,113505,55.0000,E33,S,1,False,Mrs.
64,"Klasen, Mrs.",female,36.0,3,0,2,350405,12.1833,NaN,S,0,True,Mrs.
142,"Moor, Mrs.",female,27.0,3,0,1,392096,12.4750,E121,S,1,True,Mrs.
380,"Turkula, Mrs.",female,63.0,3,0,0,4134,9.5875,NaN,S,1,True,Mrs.

Créez une colonne avec l'année de naissance du passager.

In [134]:
df["birth_year"] = 1912 - df.Age

In [135]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,is_big,title,birth_year
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0,True,Mr,1882.0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1,True,Mrs,1879.0
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0,True,Mrs,1873.0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1,True,Mrs,1885.0
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1,True,Miss,1862.0

Les billets de première classe étaient-ils plus chers ?

In [139]:
df.groupby("Pclass").Age.mean().round(1)

Pclass
1    39.2
2    29.5
3    24.8
Name: Age, dtype: float64

In [138]:
df.groupby("Pclass").Fare.mean().round(1)

Pclass
1    87.5
2    21.2
3    13.3
Name: Fare, dtype: float64

In [140]:
df.groupby("Pclass").Fare.max().round(1)

Pclass
1    512.3
2     73.5
3     69.6
Name: Fare, dtype: float64

Les hommes étaient-ils plus jeunes que les femmes sur le Titanic?

In [141]:
df.groupby("Sex").Age.mean().round(1)

Sex
female    28.7
male      30.6
Name: Age, dtype: float64

In [142]:
df.groupby("Sex").Age.median().round(1)

Sex
female    27.0
male      28.0
Name: Age, dtype: float64

Le nombre de membres de la famille a-t-il une incidence sur la probabilité de survie ?

In [145]:
df.groupby("SibSp").Survived.mean().round(2).sort_index()

SibSp
0    0.35
1    0.51
2    0.45
3    0.30
4    0.14
5    0.00
8    0.00
Name: Survived, dtype: float64

Créez une colonne qui enregistre si le numéro de billet du passager contient des lettres. Définissez une fonction pour cela et utilisez `apply`.

Exporter les données dans un fichier csv nommé `titanic_enriched.csv`.